Revit 2026 API

# FilteredElementCollectorGetElementCount Method

---

Gets the number of elements in your current filter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetElementCount()
```
```vb
Public Function GetElementCount As Integer
```
```cpp
public:
int GetElementCount()
```
```fsharp
member GetElementCount : unit -> int
```

#### Return Value

Int32 The number of elements

Does not require a filter, if called on a new FilteredElementCollector it will return a count of all the elements.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace